team-portfolio/app/controllers/comments_controller.rb

    def create
        pageName = comment_params[:page]
        @comment = current_user.comments.create(comment_params)
---
INSERT INTO "comments" ("content", "page", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "adfasdfa"], ["page", "james"], ["user_id", 2], ["created_at", "2023-11-28 21:52:51.666103"], ["updated_at", "2023-11-28 21:52:51.666103"]]