team-portfolio/app/views/comments/_index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."page" = ?  [["page", "james"]]
---
<% comments = Comment.where(page: page_name) %>